app/views/users/likes.html.erb


      <% post = Post.find_by(id: like.post_id) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]