app/views/posts/show.html.erb


    <% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = 8 AND "likes"."post_id" = ? LIMIT ?  [["post_id", 29], ["LIMIT", 1]]