app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."name" = ? LIMIT ?  [["name", "Ruby　on　Rails超入門 （たった1日で基本が身に付く！） [ 竹馬力 ]"], ["LIMIT", 1]]
INSERT INTO "books" ("created_at", "updated_at", "name", "price", "image_url", "image") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "books" SET "price" = ?, "image_url" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["price", 2266], ["image_url", "https://thumbnail.image.rakuten.co.jp/@0_mall/book/cabinet/6183/9784774196183.jpg?_ex=128x128"], ["updated_at", "2021-07-23 07:12:32.968618"], ["id", 39]]
---
  def update
    @filteredItems.each do |filteredItem|
      filteredItem.fetch_values(:name, :price, :image_url)

      #書籍の値段が変更されたとき、データも上書きされるようにしたい
      #Bookテーブルの中から、書名が一致するデータを取り出す。
      existing_book = Book.find_by(name: filteredItem[:name])
      #取り出したデータのpriceが同じなら、何もしない
      #取り出したデータのpriceが異なるなら、そのデータのpriceに値を代入してセーブする。
      if (existing_book == nil) then
        #Bookテーブルの中から書名が一致するデータがなければ、bookインスタンスを生成する
        #bookインスタンスの書名と値段を保存する
        book = Book.new
        book.name = filteredItem[:name]
        book.price = filteredItem[:price]
        book.image_url = filteredItem[:image_url]
        #画像データをダウンロードする
        save_image(filteredItem)
        book.save