app/controllers/horses_controller.rb

    def index
      @horses = Horse.all
---
SELECT "horses".* FROM "horses"

    def show
        @horse = Horse.find_by(id: params[:id])
---
SELECT  "horses".* FROM "horses" WHERE "horses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]