app/controllers/jockeys_controller.rb

SELECT "jockeys".* FROM "jockeys"
---
  def index
    @jockeys = Jockey.all