app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["post_id", 25], ["created_at", "2021-05-27 03:02:21.004561"], ["updated_at", "2021-05-27 03:02:21.004561"]]
---
    def create

      @like = Like.new(
          user_id: @current_user.id,
          post_id: params[:post_id]
      )
      @like.save