app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc) #created_atとの間に半角スペースを入れないと正常に動作しなかった。
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post = Post.find_by(id:params[:id])
    @user = @post.user  #postのdb内のuserカラム？
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 25]]

  def create

    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id
    )

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "こんにちは"], ["created_at", "2021-05-22 04:03:58.919599"], ["updated_at", "2021-05-22 04:03:58.919599"], ["user_id", 1]]