app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "スピノザ"], ["email", "causa_sui.com"], ["created_at", "2021-05-22 01:35:09.443418"], ["updated_at", "2021-05-22 01:35:09.443418"], ["image_name", "default_user.jpg"], ["password", "999"]]
---
  def create
    @user = User.new(name: params[:name],
    email: params[:email],
    image_name: "default_user.jpg",
    password: params[:password]
  )

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ヨハネス・Ｂ"], ["email", "Symphony_no5.com"], ["updated_at", "2021-05-15 15:53:01.247178"], ["id", 4]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]


    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read )
    end

    if @user.save